ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cts.c
/******************************************************************************
* Function Name: Cy_BLE_CTSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for the Current Time Service.
*
*  \param eventParam: The pointer to the data that came with a write request for the
*              Current Time Service.
*
* \return
*  Return a value of type cy_en_ble_gatt_err_code_t:
*   * CY_BLE_GATT_ERR_NONE - Function terminated successfully.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - The Handle of the Current Time Client
*                                      Configuration Characteristic Descriptor
*                                      is not valid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - An Internal Stack error occurred.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - The notification property of the
*                                             Current Time Client Configuration
*                                             Characteristic Descriptor is
*                                             disabled.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_CTSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    uint32_t event = (uint32_t)CY_BLE_EVT_CTSS_NOTIFICATION_DISABLED;
    cy_stc_ble_cts_char_value_t wrReqParam =
    {
        .gattErrorCode = CY_BLE_GATT_ERR_NONE,
        .connHandle    = eventParam->connHandle,
        .value         = &eventParam->handleValPair.value
    };

    if(Cy_BLE_CTS_ApplCallback != NULL)
    {
        /* Client Characteristic Configuration descriptor write request */
        if(eventParam->handleValPair.attrHandle == cy_ble_ctsConfigPtr->ctss->currTimeCccdHandle)
        {
            /* Verify that optional notification property is enabled for Current Time
             * Characteristic.
             */
            if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_ctsConfigPtr->ctss->currTimeCharHandle))
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair = eventParam->handleValPair,
                    .connHandle      = eventParam->connHandle,
                    .offset          = 0u,
                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                };
                wrReqParam.gattErrorCode = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                {
                    event = (uint32_t)CY_BLE_EVT_CTSS_NOTIFICATION_ENABLED;
                }

                if(wrReqParam.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                {
                    wrReqParam.charIndex = CY_BLE_CTS_CURRENT_TIME;
                    wrReqParam.value = NULL;
                    Cy_BLE_CTS_ApplCallback(event, &wrReqParam);
                }

            #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                /* Set flag to store bonding data to flash */
                if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                {
                    cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                }
            #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                    * (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
                    */
            }
            else
            {
                wrReqParam.gattErrorCode = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
            }

            /* Clear the callback flag indicating that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if((eventParam->handleValPair.attrHandle == cy_ble_ctsConfigPtr->ctss->currTimeCharHandle) ||
                (eventParam->handleValPair.attrHandle == cy_ble_ctsConfigPtr->ctss->localTimeInfCharHandle))
        {
            if(eventParam->handleValPair.attrHandle == cy_ble_ctsConfigPtr->ctss->currTimeCharHandle)
            {
                wrReqParam.charIndex = CY_BLE_CTS_CURRENT_TIME;
            }
            else
            {
                wrReqParam.charIndex = CY_BLE_CTS_LOCAL_TIME_INFO;
            }
            /* Check if write property is supported */
            wrReqParam.gattErrorCode = Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle,
                                                                     &eventParam->connHandle, CY_BLE_GATT_DB_WRITE |
                                                                     CY_BLE_GATT_DB_PEER_INITIATED);

            if(wrReqParam.gattErrorCode == CY_BLE_GATT_ERR_NONE)
            {
                /* Send callback to user. User must validate the fields of the
                 * Current Time Characteristic and then perform database
                 * Characteristic Write procedure to write all or only selected
                 * fields to the database. In case if user want to ignore some
                 * fields of Current Time Characteristic user has to set the
                 * CY_BLE_GATT_ERR_CTS_DATA_FIELD_IGNORED error value in the
                 * "gattErrorCode" field of the structure passed from the with
                 * CY_BLE_EVT_CTSS_WRITE_CHAR event. In case if no fields in the
                 * Current Time Characteristic is ignored the "gattErrorCode"
                 * should be ignored.
                 */
                Cy_BLE_CTS_ApplCallback((uint32_t)CY_BLE_EVT_CTSS_WRITE_CHAR, (void*)&wrReqParam);

                if(wrReqParam.gattErrorCode != CY_BLE_GATT_ERR_CTS_DATA_FIELD_IGNORED)
                {
                    /* Ignore all gatt errors except permitted "Data Field Ignored" */
                    wrReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                }
            }
            else
            {
                wrReqParam.gattErrorCode = CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED;
            }

            /* Clear the callback flag indicating that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* This empty else statement is required by MISRA */
        }
    }

    return(wrReqParam.gattErrorCode);
}


