ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cts.c
/******************************************************************************
* Function Name: Cy_BLE_CTSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a value for one of three characteristic values of the Current Time
*  Service. The characteristic is identified by charIndex.
*
*  \param charIndex: The index of the Current Time Service characteristic.
*  \param attrSize:  The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*              stored to the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was written successfully
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CTSS_SetCharacteristicValue(cy_en_ble_cts_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    uint16_t locYear;
    cy_stc_ble_cts_current_time_t currTime;
    cy_stc_ble_cts_local_time_info_t localTime;
    cy_stc_ble_cts_reference_time_info_t refTime;
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if(attrValue != NULL)
    {
        switch(charIndex)
        {
            case CY_BLE_CTS_CURRENT_TIME:
                if(attrSize == CY_BLE_CTS_CURRENT_TIME_SIZE)
                {
                    (void)memcpy((void*)&currTime, (void*)attrValue, (uint32_t)attrSize);

                    /* Validate characteristic value
                     * First, validate "locYear" field
                     */
                    locYear = ((uint16_t)((uint16_t)currTime.yearHigh << CY_BLE_CTS_8_BIT_OFFSET)) |
                              ((uint16_t)currTime.yearLow);

                    if((locYear >= CY_BLE_CTS_YEAR_MIN) && (locYear <= CY_BLE_CTS_YEAR_MAX))
                    {
                        /* Validation passed */
                        apiResult = CY_BLE_SUCCESS;
                    }

                    /* Validate "Month" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_MONTH_MAX < currTime.month))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    /* Next is "Day" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_DAY_MAX < currTime.day))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    /* Validate "Hours" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_HOURS_MAX < currTime.hours))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    /* Validate "Minutes" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_MINUTES_MAX < currTime.minutes))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    /* Validate "Seconds" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_SECONDS_MAX < currTime.seconds))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    /* Validate "dayOfWeek" field */
                    if((CY_BLE_ERROR_INVALID_PARAMETER != apiResult) && (CY_BLE_CTS_DAY_OF_WEEK_MAX <= currTime.dayOfWeek))
                    {
                        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                    }

                    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
                    {
                        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                        {
                            .handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->currTimeCharHandle,
                            .handleValuePair.value.len  = attrSize,
                            .offset                     = 0u,
                            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                        };
                        dbAttrValInfo.handleValuePair.value.val = (uint8_t*)&currTime;

                        /* Verify "Adjust Reason". If it is set to incorrect value then it will
                         * be changed to "Unknown" Adjust Reason. */
                        CY_BLE_CTS_CHECK_ADJUST_REASON(currTime.adjustReason);

                        /* Set Current Time Characteristic value to GATT database.
                         * Need to handle return type difference of Cy_BLE_GATTS_WriteAttributeValueCCCD() and
                         * Cy_BLE_CTSS_SetCharacteristicValue(). */

                        if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
                        {
                            /* Indicate success */
                            apiResult = CY_BLE_SUCCESS;
                        }
                    }
                }
                break;

            case CY_BLE_CTS_LOCAL_TIME_INFO:
                if(attrSize == CY_BLE_CTS_LOCAL_TIME_INFO_SIZE)
                {
                    (void)memcpy((void*)&localTime, (void*)attrValue, (uint32_t)attrSize);

                    if(((localTime.timeZone <= CY_BLE_CTS_UTC_OFFSET_MAX) &&
                        (localTime.timeZone >= CY_BLE_CTS_UTC_OFFSET_MIN)) ||
                       (localTime.timeZone == CY_BLE_CTS_UTC_OFFSET_UNKNOWN))
                    {
                        /* Validation passed */
                        apiResult = CY_BLE_SUCCESS;
                    }

