ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cts.c
                    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
                    {
                        /* Validate DST offset */
                        switch(localTime.dst)
                        {
                            case CY_BLE_CTS_STANDARD_TIME:
                            case CY_BLE_CTS_DAYLIGHT_TIME_0_5:
                            case CY_BLE_CTS_DAYLIGHT_TIME_1_0:
                            case CY_BLE_CTS_DAYLIGHT_TIME_2_0:
                            case CY_BLE_CTS_DST_UNKNOWN:
                                /* DST offset is correct */
                                apiResult = CY_BLE_SUCCESS;
                                break;

                            default:
                                /* Validation failed */
                                apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                                break;
                        }
                    }

                    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
                    {
                        if(CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_ctsConfigPtr->ctss->localTimeInfCharHandle)
                        {
                            /* Set Local Time Characteristic value to GATT database.
                             *  Need to handle return type difference of Cy_BLE_GATTS_WriteAttributeValueCCCD() and
                             *  Cy_BLE_CTSS_SetCharacteristicValue(). */
                            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                            {
                                .handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->localTimeInfCharHandle,
                                .handleValuePair.value.len  = attrSize,
                                .handleValuePair.value.val  = attrValue,
                                .offset                     = 0u,
                                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                            };
                            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
                            {
                                /* Indicate success */
                                apiResult = CY_BLE_SUCCESS;
                            }
                        }
                        else
                        {
                            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
                        }
                    }
                }
                break;

            case CY_BLE_CTS_REFERENCE_TIME_INFO:
                if(attrSize == CY_BLE_CTS_REFERENCE_TIME_INFO_SIZE)
                {
                    (void)memcpy((void*)&refTime, (void*)attrValue, (uint32_t)attrSize);

                    /* Validate "Time Source" value */
                    if(CY_BLE_CTS_TIME_SRC_CELL_NET >= refTime.timeSource)
                    {
                        /* Time source is correct */
                        apiResult = CY_BLE_SUCCESS;
                    }

                    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
                    {
                        /* Validate "Hours since update" field */
                        if(refTime.hoursSinseUpdate <= CY_BLE_CTS_HOURS_MAX)
                        {
                            /* Value is correct */
                        }
                        else if(refTime.daysSinceUpdate == CY_BLE_CTS_MAX_DAYS_SINCE_UPDATE)
                        {
                            /* Per CTS spec "Hours since update" is set to 255 as "Days since update"
                             * is 255. */
                            refTime.hoursSinseUpdate = CY_BLE_CTS_MAX_HOURS_SINCE_UPDATE;
                        }
                        else
                        {
                            /* Invalid value encountered */
                            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
                        }
                    }

                    if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
                    {
                        if(CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_ctsConfigPtr->ctss->localTimeInfCharHandle)
                        {
                            /* Set Reference Time Characteristic value to GATT database.
                             *  Need to handle return type difference of Cy_BLE_GATTS_WriteAttributeValueCCCD() and
                             *  Cy_BLE_CTSS_SetCharacteristicValue(). */
                            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                            {
                                .handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->refTimeInfCharHandle,
                                .handleValuePair.value.len  = attrSize,
                                .offset                     = 0u,
                                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                            };

                            dbAttrValInfo.handleValuePair.value.val = (uint8_t*)&refTime;

                            if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
                            {
                                /* Indicate success */
                                apiResult = CY_BLE_SUCCESS;
                            }
                        }
                        else
                        {
                            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
                        }
                    }
                }
                break;

            default:
                /* Characteristic wasn't found */
                break;
        }
    }

    /* Return status */
    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CTSS_GetCharacteristicValue
***************************************************************************//**
*
*  Gets a characteristic value of the Current Time Service, which is identified
*  by charIndex.
*
*  \param charIndex: The index of a Current Time Service characteristic.
*  \param attrSize: The size of the Current Time Service characteristic value attribute.
*  \param attrValue: The pointer to the location where characteristic value data
*             should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was read successfully
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CTSS_GetCharacteristicValue(cy_en_ble_cts_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
    {
        .handleValuePair.value.len = attrSize,
        .handleValuePair.value.val = attrValue,
        .flags                     = CY_BLE_GATT_DB_LOCALLY_INITIATED
    };

    if(attrValue != NULL)
    {
        switch(charIndex)
        {
            case CY_BLE_CTS_CURRENT_TIME:
                if(attrSize == CY_BLE_CTS_CURRENT_TIME_SIZE)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->currTimeCharHandle;
                    apiResult = CY_BLE_SUCCESS;
                }
                break;

