ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cts.c
            case CY_BLE_CTS_LOCAL_TIME_INFO:
                if(attrSize == CY_BLE_CTS_LOCAL_TIME_INFO_SIZE)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->localTimeInfCharHandle;
                    apiResult = CY_BLE_SUCCESS;
                }
                break;

            case CY_BLE_CTS_REFERENCE_TIME_INFO:
                if(attrSize == CY_BLE_CTS_REFERENCE_TIME_INFO_SIZE)
                {
                    dbAttrValInfo.handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->refTimeInfCharHandle;
                    apiResult = CY_BLE_SUCCESS;
                }
                break;

            default:
                /* Characteristic wasn't found */
                break;
        }

        if(apiResult != CY_BLE_ERROR_INVALID_PARAMETER)
        {
            if(dbAttrValInfo.handleValuePair.attrHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                /* Get characteristic value from GATT database */
                if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
                {
                    /* Indicate success */
                    apiResult = CY_BLE_SUCCESS;
                }
                else
                {
                    apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
                }
            }
            else
            {
                apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
            }
        }
    }

    /* Return status */
    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CTSS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets a characteristic descriptor of a specified characteristic of the Current
*  Time Service.
*
*  \param connHandle: The connection handle
*  \param charIndex: The index of the characteristic.
*  \param descrIndex: The index of the descriptor.
*  \param attrSize: The size of the descriptor value.
*  \param attrValue: The pointer to the location where characteristic descriptor value
*             data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional descriptor is absent
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CTSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_cts_char_index_t charIndex,
                                                               cy_en_ble_cts_char_descriptors_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((charIndex == CY_BLE_CTS_CURRENT_TIME) && (descrIndex == CY_BLE_CTS_CURRENT_TIME_CCCD))
    {
        if(cy_ble_ctsConfigPtr->ctss->currTimeCccdHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            /* Get characteristic value from GATT database */
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_ctsConfigPtr->ctss->currTimeCccdHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .connHandle                 = connHandle,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                /* Indicate success */
                apiResult = CY_BLE_SUCCESS;
            }
            else
            {
                apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CTSS_SendNotification
***************************************************************************//**
*
*  Sends a notification to the client's device. A characteristic value also gets
*  written to the GATT database.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  'Handle Value Notification' which results in CY_BLE_EVT_CTSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of a service characteristic to be send as a notification
*             to the Client device.
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*             sent to the Client device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic notification was sent successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*   * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this.
*                                      characteristic.
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the client is not established.
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the client.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CTSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                    cy_en_ble_cts_char_index_t charIndex,
                                                    uint8_t attrSize,
                                                    uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;

    if(CY_BLE_CTS_CURRENT_TIME != charIndex)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else
    {
        apiResult = Cy_BLE_CTSS_SetCharacteristicValue(charIndex, attrSize, attrValue);
        if(apiResult == CY_BLE_SUCCESS)
        {
            if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
            {
                apiResult = CY_BLE_ERROR_INVALID_STATE;
            }
            else if((cy_ble_ctsConfigPtr->ctss->currTimeCccdHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) ||
                    (!CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, cy_ble_ctsConfigPtr->ctss->currTimeCccdHandle)))
            {
                apiResult = CY_BLE_ERROR_NTF_DISABLED;
            }
            else
            {
                /* Fill all fields of write request structure ... */
                cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
                {
                    .handleValPair.attrHandle = cy_ble_ctsConfigPtr->ctss->currTimeCharHandle,
                    .handleValPair.value.val  = attrValue,
                    .handleValPair.value.len  = attrSize,
                    .connHandle               = connHandle
                };
                /* Send notification to client using previously filled structure */
                apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
            }
        }
    }

    /* Return status */
    return(apiResult);
}

#endif /* (CY_BLE_CTS_SERVER) */


#ifdef CY_BLE_CTS_CLIENT

