ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cts.c
/******************************************************************************
* Function Name: Cy_BLE_CTSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event for the Current Time Service.
*
*  \param eventParam: The pointer to the data that came with a read response for CTS.
*
******************************************************************************/
static void Cy_BLE_CTSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t fFlag = 1u;
    uint32_t attrVal = 0u;
    cy_en_ble_cts_char_index_t idx = CY_BLE_CTS_CURRENT_TIME;

    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_CTS_ApplCallback != NULL) &&
       (cy_ble_ctscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_CURRENT_TIME].valueHandle ==
           cy_ble_ctscReqHandle[discIdx])
        {
            idx = CY_BLE_CTS_CURRENT_TIME;
        }
        else
            if(cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_LOCAL_TIME_INFO].valueHandle ==
               cy_ble_ctscReqHandle[discIdx])
            {
                idx = CY_BLE_CTS_LOCAL_TIME_INFO;
            }
            else
                if(cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_REFERENCE_TIME_INFO].valueHandle ==
                   cy_ble_ctscReqHandle[discIdx])
                {
                    idx = CY_BLE_CTS_REFERENCE_TIME_INFO;
                }
                else if(cy_ble_ctsc[discIdx].currTimeCccdHandle == cy_ble_ctscReqHandle[discIdx])
                {
                    /* Attribute is Characteristic Descriptor  */
                    attrVal = 1u;
                }
                else
                {
                    /* No CTS characteristics were requested for read */
                    fFlag = 0u;
                }

        if(fFlag != 0u)
        {
            /* Read response for characteristic */
            if(attrVal == 0u)
            {
                /* Fill Current Time Service read response parameter structure with
                 * characteristic info. */
                cy_stc_ble_cts_char_value_t rdRspParam = { .connHandle = eventParam->connHandle };
                rdRspParam.charIndex = idx;
                rdRspParam.value = &eventParam->value;

                Cy_BLE_CTS_ApplCallback((uint32_t)CY_BLE_EVT_CTSC_READ_CHAR_RESPONSE, (void*)&rdRspParam);
            }
            else /* Read response for characteristic descriptor */
            {
                /* Fill Current Time Service read response parameter structure with
                 *  characteristic descriptor info. */
                cy_stc_ble_cts_descr_value_t rdRspParam =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = CY_BLE_CTS_CURRENT_TIME,
                    .descrIndex = CY_BLE_CTS_CURRENT_TIME_CCCD,
                    .value      = &eventParam->value
                };
                Cy_BLE_CTS_ApplCallback((uint32_t)CY_BLE_EVT_CTSC_READ_DESCR_RESPONSE, (void*)&rdRspParam);
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_ctscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CTSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles the Write Response Event for the Current Time Service.
*
*  \param eventParam: The pointer to the cy_stc_ble_conn_handle_t data structure.
*
******************************************************************************/
static void Cy_BLE_CTSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_CTS_ApplCallback != NULL) &&
       (cy_ble_ctscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_ctsc[discIdx].currTimeCccdHandle == cy_ble_ctscReqHandle[discIdx])
        {
            cy_stc_ble_cts_descr_value_t wrRspParam =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_CTS_CURRENT_TIME,
                .descrIndex = CY_BLE_CTS_CURRENT_TIME_CCCD,
                .value      = NULL
            };
            cy_ble_ctscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_CTS_ApplCallback((uint32_t)CY_BLE_EVT_CTSC_WRITE_DESCR_RESPONSE, (void*)&wrRspParam);
        }
        else if((cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_CURRENT_TIME].valueHandle ==
                 cy_ble_ctscReqHandle[discIdx]) ||
                (cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_LOCAL_TIME_INFO].valueHandle ==
                 cy_ble_ctscReqHandle[discIdx]))
        {
            cy_stc_ble_cts_char_value_t wrRspParam;
            if(cy_ble_ctsc[discIdx].currTimeCharacteristics[CY_BLE_CTS_CURRENT_TIME].valueHandle ==
               cy_ble_ctscReqHandle[discIdx])
            {
                wrRspParam.charIndex = CY_BLE_CTS_CURRENT_TIME;
            }
            else
            {
                wrRspParam.charIndex = CY_BLE_CTS_LOCAL_TIME_INFO;
            }
            wrRspParam.connHandle = *eventParam;
            wrRspParam.value = NULL;

            cy_ble_ctscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_CTS_ApplCallback((uint32_t)CY_BLE_EVT_CTSC_WRITE_CHAR_RESPONSE, (void*)&wrRspParam);
        }
        else
        {
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CTSC_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles the Error Response Event for the Current Time Service.
*
*  \param eventParam: The pointer to the cy_stc_ble_gatt_err_param_t structure.
*
******************************************************************************/
static void Cy_BLE_CTSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    if(eventParam != NULL)
    {
        uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
        if(eventParam->errInfo.attrHandle == cy_ble_ctscReqHandle[discIdx])
        {
            cy_ble_ctscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}

